app/controllers/school_classes_controller.rb

    def index
        @school_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def create
        @school_class = SchoolClass.new(school_class_params(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "chemical"], ["room_number", 1], ["created_at", "2019-04-18 04:52:10.906165"], ["updated_at", "2019-04-18 04:52:10.906165"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-04-19 18:24:13.551262"], ["id", 1]]