app/controllers/students_controller.rb

    def create
      @student = Student.new(students_params(:first_name, :last_name))
      @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-04-19 16:15:34.545359"], ["updated_at", "2019-04-19 16:15:34.545359"]]

    def update
      @student = Student.find(params[:id])
      @student.update(students_params(:first_name,:last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-19 18:24:13.683199"], ["id", 1]]